---
kind: type
id: T:Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
source: html/4d82ed63-8fd2-71a9-52e8-4695ab299b1b.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs

The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened] .

## Syntax (C#)
```csharp
public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs
```